hello-yaowq/as-1/com/as.infrastructure/arch/stm32f1/mcal/Can.c
	r_size = 0;
}

void Can_Init( const Can_ConfigType *Config )
{
  // Do initial configuration of layer here
	(void)Config;
	r_size = 0;
	r_pos = 0;
	w_pos = 0;
	r_counter = 0;
	swPduHandle = CAN_EMPTY_MESSAGE_BOX;
}

void Can_InitController( uint8 controller, const Can_ControllerConfigType *config)
{
	(void)controller;
	(void)config;
}

Can_ReturnType Can_SetControllerMode( uint8 Controller, Can_StateTransitionType transition )
{
	(void)Controller;
	switch(transition )
	{
		case CAN_T_START:	/* no break here */
		case CAN_T_WAKEUP:
			USART_ITConfig(USART2,USART_IT_RXNE,ENABLE);
			NVIC_EnableIRQ(USART2_IRQn);
		break;
		case CAN_T_SLEEP:
		case CAN_T_STOP:
		default:
			USART_ITConfig(USART2,USART_IT_RXNE,DISABLE);
			NVIC_DisableIRQ(USART2_IRQn);
		break;
	}
	return E_OK;
}

Can_ReturnType Can_Write( Can_Arc_HTHType hth, Can_PduType *pduInfo )
{
	uint32_t i;
	imask_t imask;
	Can_ReturnType rv = CAN_OK;

	Irq_Save(imask);

	if(CAN_EMPTY_MESSAGE_BOX == swPduHandle)
	{
		printf("SCAN%02X%04X%02X",hth,(unsigned int)pduInfo->id,pduInfo->length);
		asAssert(pduInfo->length <= 8);
		for(i=0;i<pduInfo->length;i++)	/* maximum 16 */
		{
			printf("%02X",pduInfo->sdu[i]);
		}
		printf("\n");

		swPduHandle = pduInfo->swPduHandle;
	}
	else
	{
		rv = CAN_BUSY;
	}

	Irq_Restore(imask);

	return rv;
}
void knl_isr_usart2_process(void)	/* USART2_IRQn = 38 + 15 = 53 */
{

	if(USART_GetITStatus(USART2,USART_IT_RXNE))
	{

		char chr = (char)(USART_ReceiveData(USART2)&0xFF);

		r_cache[r_size++] = chr;

		if('\n' == chr)
		{
			rx_notifiy();
		}

		if(r_size >= sizeof(r_cache))
		{
			r_size = 0;
		}
		USART_ClearITPendingBit(USART2,USART_IT_RXNE);
	}

	NVIC_ClearPendingIRQ(USART2_IRQn);
}

void Can_DisableControllerInterrupts( uint8 controller )
{
	(void)controller;
	NVIC_DisableIRQ(USART2_IRQn);
}

void Can_EnableControllerInterrupts( uint8 controller )
{
	(void)controller;
	NVIC_EnableIRQ(USART2_IRQn);
}


// Hth - for Flexcan, the hardware message box number... .We don't care
void Can_Cbk_CheckWakeup( uint8 controller ){(void)controller;}

void Can_MainFunction_Write( void )
{
	if(CAN_EMPTY_MESSAGE_BOX != swPduHandle)
	{
		CanIf_TxConfirmation(swPduHandle);
		swPduHandle = CAN_EMPTY_MESSAGE_BOX;
	}
}
void Can_MainFunction_Read( void )
{
	imask_t imask;
	Can_SerialPduType* pdu;

	while(r_counter > 0)
	{
		Irq_Save(imask);
		r_counter --;
		pdu = &rQ[r_pos++];
		if(r_pos >= CAN_SERIAL_Q_SIZE)
		{
			r_pos = 0;
		}
		Irq_Restore(imask);

		CanIf_RxIndication(pdu->busid,pdu->canid,pdu->dlc,pdu->data);
	}


}
void Can_MainFunction_BusOff( void ){}
void Can_MainFunction_Wakeup( void ){}
void Can_MainFunction_Error ( void ){}

void Can_Arc_GetStatistics( uint8 controller, Can_Arc_StatisticsType * stat){(void)controller;(void)stat;}

#endif

KSM(CANIdle,Init)
{
	KGS(CANIdle,Running);
}
KSM(CANIdle,Start)
{
}
KSM(CANIdle,Stop)
{

}
KSM(CANIdle,Running)
{
	Can_MainFunction_Write();
	Can_MainFunction_Read();
}


